In [1]:
# a list of high schools
high_schools = ["Hernandez High School","Figueroa High School","Wilson High School","Wright High School"]
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [2]:
# A list of dictionaries of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
for school_type in high_school_types:
    print(school_type)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [4]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [2]:
import pandas as pd

In [17]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
#school_series.dtype
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [8]:
for school in school_series:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [18]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [19]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [20]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [21]:
#Initialize a dataframe
schools_df = pd.DataFrame()

In [22]:
schools_df["School ID"] = school_id
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [23]:
schools_df["School Name"] = school_name
schools_df["Type"] = type_of_school
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [24]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [25]:
high_schools_df = pd.DataFrame(high_schools_dict)
high_schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [26]:
high_schools_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
high_schools_type = ["District","District","Charter","District","Charter","Charter","Charter","District","Charter","Charter","Charter","District","District","District","Charter"]

In [27]:
high_school_df = pd.DataFrame()
high_school_df["School ID"] = high_schools_id
high_school_df["school_name"] = high_schools
high_school_df["type"] = high_schools_type

In [39]:
#high_school_df.head(2)
high_school_df.head()

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [45]:
#high_school_df.tail()
#high_school_df.tail(2)
high_school_df[['school_name', 'type']].head(2)

            school_name      type
0     Huang High School  District
1  Figueroa High School  District

In [32]:
high_school_df.sample()

   School ID         school_name      type
7          7  Bailey High School  District

In [34]:
high_school_df.sample(2)

    School ID            school_name      type
11         11  Rodriguez High School  District
2           2    Shelton High School   Charter

In [35]:
high_school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [36]:
!ls

PyCitySchools.ipynb          cleaning_student_names.ipynb
README.md                    jupyter_practice.ipynb
Resources                    pandas_practice.ipynb
cleaning_data.ipynb

In [49]:
#help(pd.DataFrame)

In [41]:
high_school_df.describe()

       School ID
count  15.000000
mean    7.000000
std     4.472136
min     0.000000
25%     3.500000
50%     7.000000
75%    10.500000
max    14.000000

In [62]:
high_school_df['type'].unique()

array(['District', 'Charter'], dtype=object)

In [61]:
high_school_df['type'].value_counts()

Charter     8
District    7
Name: type, dtype: int64

In [53]:
len(high_school_df)

15

In [55]:
#returns unique elements in a column
high_school_df.type.unique()

array(['District', 'Charter'], dtype=object)

In [56]:
# returns a tuple of row and col numbers
high_school_df.shape

(15, 3)

In [57]:
#return a listof indexes in df
list(high_school_df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [60]:

high_school_df['type'].count()

15

In [64]:
high_school_df.iloc[10:]

    School ID            school_name      type
10         10     Wright High School   Charter
11         11  Rodriguez High School  District
12         12    Johnson High School  District
13         13       Ford High School  District
14         14     Thomas High School   Charter

In [66]:
high_school_df.iloc[10,1]

'Wright High School'

In [67]:
high_school_df.sort_values('School ID', ascending=False)

    School ID            school_name      type
14         14     Thomas High School   Charter
13         13       Ford High School  District
12         12    Johnson High School  District
11         11  Rodriguez High School  District
10         10     Wright High School   Charter
9           9       Pena High School   Charter
8           8     Holden High School   Charter
7           7     Bailey High School  District
6           6    Cabrera High School   Charter
5           5     Wilson High School   Charter
4           4    Griffin High School   Charter
3           3  Hernandez High School  District
2           2    Shelton High School   Charter
1           1   Figueroa High School  District
0           0      Huang High School  District

In [71]:
high_school_df[high_school_df['School ID']>12]

    School ID         school_name      type
13         13    Ford High School  District
14         14  Thomas High School   Charter